# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilledRegion..::..Create Method
FilledRegion Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, ElementId, IList<(Of <<'(CurveLoop>)>>)) | Creates a view-specific filled region from the given boundaries. |
| Create(Document, ElementId, SketchPlane, IList<(Of <<'(CurveLoop>)>>)) | Creates a filled region on a sketch plane in a 3d model family. |

# See Also
FilledRegion Class
FilledRegion Members
Autodesk.Revit.DB Namespace